Hi @Louis-Le-Saux , can you show a compete view of you `terraform plan`, in my case if I don't add the `storage_account_id` to `ignore_changes` the terraform plan will show the diff like, even I had added the `create_option` to ignore_changes.
```
  # azurerm_managed_disk.test must be replaced
-/+ resource "azurerm_managed_disk" "test" {
      ~ create_option                     = "Import" -> "Empty"
      ~ disk_iops_read_only               = 0 -> (known after apply)
      ~ disk_iops_read_write              = 500 -> (known after apply)
      ~ disk_mbps_read_only               = 0 -> (known after apply)
      ~ disk_mbps_read_write              = 60 -> (known after apply)
      ~ id                                = "/subscriptions/79133cc5-0525-4c13-9cca-4298eca1d3e1/resourceGroups/acctestRG/providers/Microsoft.Compute/disks/acctestd" -> (known after apply)
      + logical_sector_size               = (known after apply)
      ~ max_shares                        = 0 -> (known after apply)
        name                              = "acctestd"
      - on_demand_bursting_enabled        = false -> null
      - storage_account_id                = "/subscriptions/<redacted>/resourceGroups/acctestRG/providers/Microsoft.Storage/storageAccounts/accsa1284" -> null # forces replacement
        tags                              = {
            "environment" = "acctest"
        }
      + tier                              = (known after apply)
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (20 unchanged attributes hidden)
    }
```

This is expected behavior of `ignore_changes`, from the [Terraform doc](https://developer.hashicorp.com/terraform/language/meta-arguments/lifecycle#ignore_changes):
> The arguments corresponding to the given attribute names are considered when planning a create operation, but are ignored when planning an update. 

And from the [discussion](https://discuss.hashicorp.com/t/possible-to-ignore-changes-but-still-manage/38842/4):

> if you specify ignore_changes then Terraform will always disregard the configuration changes for the specified arguments, even if other arguments have changed.

> The only time Terraform will incorporate a new value for an argument that has ignore_changes set is when entirely replacing the object – deleting the old one and creating a new one – in which case the new object will adopt the value as currently specified in the configuration.

So if this is the case you may add `storage_account_id` to `ignore_changes` to avoid recreating the resource. Thanks.                